Repository: necrose99/Myaamia
Catalog: ilda_full.tmx
Source language: mia
Languages: en_us

source: kociihsasiip-
en_us: St. Joseph River (Indiana)

source: kocim-
en_us: Ask him

source: kocimol-
en_us: Ask him for

source: kociween-
en_us: Wrestle him

source: kociweeniwee-
en_us: Wrestle

source: kociweentii-
en_us: Wrestle each other

source: kociyohkam-
en_us: Try to deal with, work it out

source: kohs-
en_us: Be afraid of him, fear him

source: kohsetaatii-
en_us: Respect each other

source: kohsetam-
en_us: Show respect to it, honor it

source: kohsetaw-
en_us: Show respect to him

source: koohkooš-
en_us: Pig

source: koohkooša awiilaw-
en_us: Purslane (Portulaca oleracea)

source: koohkoošihkinaahkw-
en_us: Armadillo

source: koohkoošikaan-
en_us: Hog Pen

source: koohsi-
en_us: Mouse (Peromyscus maniculatus)

source: kookaan-
en_us: Spoon for eating (generic)

source: kookaanihs-
en_us: Teaspoon

source: kookii-
en_us: To dive, submerge into a body of water

source: koolawahtoo-
en_us: Add to it

source: koonapi-
en_us: Be or get covered in snow

source: kooni-
en_us: There is snow on the ground, it is snowy

source: koonilenioons-
en_us: Snowman

source: kotaahkatoo-
en_us: Weigh it

source: kotaahkonaakan-
en_us: Acre (of land), ruler, yardstick

source: kotaahkonam-
en_us: Measure it by hand

source: kotaham-
en_us: Measure it

source: kotahtee-
en_us: Practice shooting

source: kotak-
en_us: other, another

source: kotakinaakosi-
en_us: He is entirely different

source: kotakinaakwat-
en_us: It is another thing, something else

source: kotakinki
en_us: Otherwise, differently

source: kotakwee-
en_us: Say otherwise, say another thing

source: kotantam-
en_us: Taste it

source: koteehtaakan-
en_us: Chimney, smokehole

source: koteeli-
en_us: Try

source: koteew-
en_us: Fire

source: koteewaapiikw-
en_us: electricity, electric wire

source: koteewaapow-
en_us: Liquor

source: koteewikaan-
en_us: Fireplace

source: kwaahkw-
en_us: Pileated woodpecker (Hylatomus pileatus)

source: kwaahkwaanhsi-
en_us: Grasshopper (Caelifera)

source: kwaahkwaanši-
en_us: Leech (Hirudinea)

source: kwaantihtan-
en_us: Waterfall

source: kweehsi-
en_us: Female bird, hen

source: kweehsiaanikop-
en_us: Bitternut Hickory (Carya cordiformis)

source: kweehsitaatiinki
en_us: Respecting, christmas

source: kwiilam-
en_us: Lose him

source: kwiilotam-
en_us: Lose it

source: kwiiw-
en_us: Young man (unmarried)

source: kwiiwihs-
en_us: Young boy

source: kyaal-
en_us: Hide him

source: kyaalom-
en_us: criticize him, put him down out of envy

source: kyaankomwi-
en_us: Speak out of jealousy

source: kyaankowiteehee-
en_us: Feel jealous

source: kyaasi-
en_us: Hide oneself, be hidden

source: kyaatee-
en_us: it hides, is hidden

source: kyaatoo-
en_us: Hide it

source: kyaaweem-
en_us: Be jealous of him

source: -lakahkw-
en_us: palate, the roof of one's mouth

source: -lakiš-
en_us: Guts, entrails

source: -lehši-
en_us: Testicle

source: -lencihkan-
en_us: Glove

source: -lenkwal-
en_us: Son-in-law

source: -lenkwalehs-
en_us: Nephew (Cross-nephew)

source: -lenkwan-
en_us: Wing

source: -lookan-
en_us: hip, lap

source: leekawihtanwi siipiiw-
en_us: Guyandotte River (West Virginia)

source: lenanconci
en_us: Right, to the right

source: lenimahwi-
en_us: Coyote (Canis latrans)

source: leninš-
en_us: Milkweed (Asclepias syriaca)

source: lenipinši-
en_us: Underwater panther, Whale (cetaceans), water being

source: linkitee-
en_us: It melts, it thaws

source: lookweeš-
en_us: Buckle

source: -mataahkom-
en_us: Piece of clothing, garment

source: -mehkom-
en_us: Vein, pulse

source: -mehšoom-
en_us: Grandfather, grandpa

source: -mihs-
en_us: Elder sister, older sister

source: -mintikom-
en_us: Tonsil

source: -mootay-
en_us: stomach

source: -mooyic-
en_us: Belly, stomach

source: maacaa-
en_us: Depart, head off, leave

source: maacaamwi-
en_us: Run away

source: maaciicimee-
en_us: Swim off, swim away

source: maaciih-
en_us: Adopt him

source: maaciihkaahtoo-
en_us: Begin it, start it in motion

source: maaciiyohkam-
en_us: Begin to do, make it

source: maahaakan-
en_us: Shovel

source: maaham-
en_us: Scoop it, dig it

source: maahw-
en_us: Shovel him/her

source: maakahkwan-
en_us: Vine, wild sarsaparilla (Aralia nudicaulis)

source: maakooci
en_us: Futilely, with no result, to no avail

source: maalami
en_us: Too much

source: maalhs-
en_us: Knife

source: maalhsaahkw-
en_us: Knife Handle

source: maalhsehki-
en_us: Knife Maker

source: maalooseenti-
en_us: Cottonwood tree (Populus deltoides)

source: maamaahkwi-
en_us: One who is lewd, dissolute

source: maamaayohkaa-
en_us: Have a cramp, cramps

source: maamahkatiaahkatw-
en_us: Black oak (Quercus velutina), northern red oak (Quercus rubra)

source: maamawi
en_us: Together

source: maamihšihk-
en_us: Almost, nearly

source: maamiikaahki-
en_us: Warrior

source: maamilaniwiaahkwi-
en_us: Pokeweed (Phytolacca americana)

source: maamišaahkwaahee-
en_us: Practice shooting lacrosse

source: maamišimiš-
en_us: American Chestnut (Castanea dentata)

source: maankw-
en_us: Common Loon (Gavia immer)

source: maati-
en_us: A lazy person, idler

source: maaw-
en_us: The most, the very

source: maawahaakan-
en_us: Rake

source: maawaham-
en_us: Rake it

source: maawatonki-
en_us: Commander, officer, general

source: maawihšin-
en_us: Head of a band or hunting party

source: maawihšinaakan-
en_us: band, hunting party

source: maawikim-
en_us: Principal chief, council chief

source: maawipyaa-
en_us: Gather in a group, assemble together, come together

source: maayaahkwee-
en_us: Noon, south

source: maayahtoo-
en_us: Save it, accumulate it

source: maaye
en_us: as soon as

source: maayon-
en_us: Collect him (animate objects), gather him by hand

source: maayonam-
en_us: Collect it, gather it by hand

source: maci-
en_us: Bad, evil, mean

source: maci-alemw-
en_us: Mean Dog

source: maci-manetoow-
en_us: Mean Spirit

source: macileni-
en_us: Bad man

source: mahamaa-
en_us: Set the table

source: mahikan-
en_us: Mahican person, Stockbridge person

source: mahkam-
en_us: rob him, take things from him by force

source: mahkateehsam-
en_us: paint it black

source: mahkateeleni-
en_us: African American

source: mahkateemihkw-
en_us: Chimney swift (Chaetura pelagica), Black swift (Cypseloides niger)

source: mahkateemihšiiwi-
en_us: Moose (Alces alces)

source: mahkateew-
en_us: Charcoal, Gunpowder

source: mahkateewaapiikw-
en_us: black ribbon

source: mahkateewee-
en_us: It is black

source: mahkateeweekin-
en_us: It is black cloth, paper

source: mahkateewihtoo-
en_us: Make it black

source: mahkateeyonam-
en_us: Make it black by hand

source: mahkateeyosi-
en_us: Be black

source: mahkihkiw-
en_us: Herb medicine

source: mahkiikw-
en_us: Marsh

source: mahkisen-
en_us: Shoe, moccasin

source: mahkisinaakan-
en_us: Moccasin top (with ribbonwork)

source: mahkomiš-
en_us: Staghorn sumac (Rhus typhina)

source: mahkonkwee-
en_us: it is dull, blunt

source: mahkoons-
en_us: Young black bear, bear cub

source: mahkopina siipiiw-
en_us: Macoupin River

source: mahkoteew-
en_us: Prairie

source: mahkw-
en_us: American Black Bear (Ursus americanus)

source: mahkwa wiiloomiš-
en_us: Cherry Tree (wild) (Prunus serotina)

source: mahsakahkw-
en_us: Badger (Taxidea taxus)

source: mahsenaham-
en_us: Owe it

source: mahsenahamaw-
en_us: Owe it to him

source: mahsihtaakan-
en_us: sunflower

source: mahsinaakan-
en_us: Newspaper, letter, paper

source: mahtapihsaa-
en_us: Jump down, fling oneself down

source: mahtohkatoopow-
en_us: Cracked hominy soup

source: mahtohkatw-
en_us: Cracked corn, hominy

source: mahtohkišam-
en_us: Chop it up, cut it up

source: mahtohkišw-
en_us: Chop him up, cut him up

source: mahweew-
en_us: Wolf (Canis lupus)

source: mahweeyaahkw-
en_us: Burning Bush, Wahoo (Euonymus atropurpureus)

source: makiinkweemin-
en_us: Blackberry (Rubus allegheniensis)

source: makil-
en_us: Bark at him

source: mal-
en_us: Have sexual intercourse with him/her

source: maleehpihtam-
en_us: Dislike the taste of it, think it tastes bad

source: maleehpokosi-
en_us: He tastes bad

source: maleehpw-
en_us: Dislike the taste of him, think he tastes bad

source: maleehpwan-
en_us: It tastes bad

source: maleewaacimwi-
en_us: Say bad things, speak evil

source: maleewaalahkwat-
en_us: Be a bad cloud, bad air

source: maleewaamihki-
en_us: it is bad soil, infertile ground

source: maleewahki-
en_us: It is poor/bad land

source: maleewahkionk-
en_us: hell, evil place

source: maleewat-
en_us: it is bad, wicked

source: maleewee-
en_us: Talk badly, blaspheme

source: maleeweekan-
en_us: Bad language

source: maleewinaakat-
en_us: it is dangerous

source: maleewiniikin-
en_us: Grow badly

source: maleewiteehee-
en_us: He has an evil heart, is wicked

source: maleewiteeheelotaw-
en_us: have a bad heart towards him, antipathy towards him

source: maleewiton-
en_us: speak badly, have a bad mouth

source: maleewišileni-
en_us: Do bad, evil

source: maleeyom-
en_us: Speak badly of him, to him

source: maleeyonkwaam-
en_us: Sleep poorly

source: maleeyosi-
en_us: He is ugly, bad, evil

source: malotakaham-
en_us: play the straw game

source: mamahkiihsi-
en_us: toad

source: mamaw-
en_us: Buy from him, take from him

source: mame-
en_us: Take it, buy it

source: mananci-
en_us: Be left-handed

source: mananconci
en_us: Left (side)

source: maneehtoo-
en_us: Spend it, deplete it, use it up

source: maneehwi-
en_us: Be absent, gone

source: maneehwion-
en_us: Nothingness

source: maneesi-
en_us: Have nothing, none

source: maneet-
en_us: be absent, gone, lacking

source: manehsaw-
en_us: Gather wood for him

source: manehsee-
en_us: Gather wood, gather firewood

source: manetawion-
en_us: Spirituality

source: manetoow-
en_us: Manitou

source: manetw-
en_us: Snow

source: mankaalakiinkweemin-
en_us: Dewberry

source: mankahsenahki-
en_us: Lake Maxinkuckee, Big Stone Lake

source: mankiiš-
en_us: Medicine

source: mankiišaahkw-
en_us: Sassafras (Sassafras albidum), Ague tree

source: mankiišaahkwaapow-
en_us: Sassafras Tea

source: mankiišaapow-
en_us: Liquid Medicine

source: mankilaan-
en_us: It is a great rain, heavy rain, flood

source: mankišam-
en_us: Cut something big

source: mantepway-
en_us: Lodge frame (without mats)

source: masaan-
en_us: Thread

source: masaana siipiiw-
en_us: Mazon River

source: masaanaapiikw-
en_us: Rope

source: masaanihkii-
en_us: make thread, cord, hemp

source: mayaaw-
en_us: Really, very, actually (used as an intensifier)

source: mayaawaapam-
en_us: Look directly at him

source: mayaawaapan-
en_us: It is the crack of dawn, first light

source: mayaawikaan-
en_us: A center (general)

source: meehc-
en_us: After, finish

source: meehcaakamiins-
en_us: Small stream, creek

source: meehceelintam-
en_us: Decide it, finish thinking of it

source: meehcih-
en_us: Finish making him

source: meehcihpenatoo-
en_us: Be finished with it

source: meehcihtoo-
en_us: Finish it, complete it, done with it

source: meehciinkwi-
en_us: Prophet

source: meehciweel-
en_us: Afterwards, last, later

source: meehkohsinki siipiiw-
en_us: Wisconsin River

source: meehtaaha
en_us: Less

source: meehtaham-
en_us: Finish it, make it

source: meehtantam-
en_us: Finish eating it

source: meehtikooši-
en_us: French

source: meehtitee-
en_us: It is finished cooking

source: meehšaapantaakan-
en_us: Microscope

source: meekwaak-
en_us: Turnip (Brassica rapa)

source: meelanotank-
en_us: Lawyer, one who argues

source: meeleewaatawi-
en_us: German

source: meemeehšihki-
en_us: Dragonfly

source: meemeekwa
en_us: Maybe, perhaps

source: meemeeti-
en_us: Run a race

source: meemeetim-
en_us: Race him

source: meemihkwihkici-
en_us: Red-tailed hawk

source: meemiihkimi-
en_us: Workman, worker, employee

source: meemileehši-
en_us: Groundhog (Marmota monax)

source: meenankweepiak-
en_us: Pleiades (constellation)

source: meenkaalakiinkweemiš-
en_us: Dewberry bush (Rubus flagellaris)

source: meetaathsoopi-
en_us: Congress, President of the United States

source: meetaathsoopionk-
en_us: Washington D.C.

source: meešimeelwi-
en_us: Great Horned Owl (Bubo virginianus)

source: mehceeli-
en_us: Value, high esteem

source: mehcikaateem-
en_us: Be barefoot

source: mehcikili-
en_us: Big

source: mehkam-
en_us: Find it

source: mehkaw-
en_us: Find him

source: mehkaweelim-
en_us: Honor him (?)

source: mehkwaalantee-
en_us: It is purple

source: mehtahkahtoo-
en_us: Put it down, on the ground

source: mehtahkapi-
en_us: Sit down on the ground

source: mehtohseeni-
en_us: Human, Person

source: mehtohseeniwi-
en_us: Live

source: mehtohseeniwih-
en_us: Make him live, make him human

source: mehšihtoo-
en_us: Enlarge it, increase it

source: mehšiili-
en_us: Be abundant, numerous

source: mehšiisihtoo-
en_us: Have a lot of it, be wealthy

source: mehšilaakii-
en_us: Make a goal

source: mehšišaaki-
en_us: be naked

source: melaam-
en_us: Smell it

source: melaaw-
en_us: Smell him

source: melanotam-
en_us: Argue it, debate it

source: melantam-
en_us: To vomit, puke

source: melihtikw-
en_us: Snot, mucus

source: melohtam-
en_us: enjoy hearing it

source: melohtaw-
en_us: enjoy hearing him

source: melom-
en_us: Say good things to him

source: meloniteehee-
en_us: Study, reflect, ponder, do homework

source: melonwaakan-
en_us: Counsel, advice

source: melonwee-
en_us: To hold a meeting

source: melonweem-
en_us: To hold a meeting with him

source: meloonim-
en_us: slander him

source: memekwii-
en_us: Run

source: memekwiihsah-
en_us: Cause him to run fast (as in a horse being ridden)

source: men-
en_us: Drink something

source: menaankweepi-
en_us: Be grouped together, bunched together

source: menah-
en_us: Give him something to drink

source: menahiwee-
en_us: Give people something to drink

source: menapi-
en_us: Sit separate from others, community

source: mencihšin-
en_us: Stumble

source: menehkwaakan-
en_us: Cup

source: mentam-
en_us: Be sick

source: mentaminaakosi-
en_us: Appear sick, ill

source: mentitohkaal-
en_us: Honor him, admire him, welcome (formal)

source: mentokisi-
en_us: To be proud

source: metem-
en_us: Follow his trail

source: metemohs-
en_us: woman

source: mešaham-
en_us: Spear it

source: mešotam-
en_us: Shoot at and hit it

source: mešw-
en_us: Shoot and hit him

source: mihcaahkwat-
en_us: be a big tree

source: mihcalaankw-
en_us: Morning Star, Planet

source: mihkintaakan-
en_us: Pillow

source: mihkohpina siipiiw-
en_us: Potato Creek

source: mihs-
en_us: piece of firewood

source: mihsi-siipiiw-
en_us: Mississippi River

source: mihsool-
en_us: Boat, canoe

source: mihsoolatenw-
en_us: Mount Joliet, Canoe hill

source: mihswi-
en_us: it is a dead tree, dry wood

source: mihtahk-
en_us: Below, downward

source: mihtahkatw-
en_us: Hay

source: mihtam-
en_us: First, earlier

source: mihtekamin-
en_us: Acorn

source: mihtekamiš-
en_us: Oak tree (generic)

source: mihtekoopaahkw-
en_us: Bow wood

source: mihtekowalaakan-
en_us: Wooden box, thousand dollars

source: mihtekwaapimin-
en_us: Mulberry

source: mihtekwaapimišaahkw-
en_us: Mulberry tree (Morus rubra)

source: mihtohseenion-
en_us: Life

source: mihšaa-
en_us: it is big

source: mihšahkwat-
en_us: It is a clear sky

source: mihši-
en_us: yet (used with negative)

source: mihši-maalhs-
en_us: American

source: mihši-maalhseens-
en_us: American boy

source: mihši-maalhsehkwi-
en_us: American woman

source: mihši-nipwaantiikaan-
en_us: University, college

source: mihšihkatw-
en_us: War

source: mihšihkinaahkw-
en_us: Painted terrapin turtle (Chrysemys spp.)

source: mihšiimin-
en_us: Apple

source: mihšiiminaapow-
en_us: Apple Cider, Apple Juice

source: mihšiimišaahkw-
en_us: Apple tree

source: mihšiinkweemiš-
en_us: Bur Oak (Quercus macrocarpa)

source: mihšiinkweemišahk-
en_us: Bur Oak Grove

source: mihšiiwi-
en_us: Elk (Cervus canadensis)

source: mihšiiwiateehi siipiiw-
en_us: Elkhart River

source: mihšiiwiay-
en_us: Elk hide

source: mihšikaateekan-
en_us: Big toe

source: mihšilaakan-
en_us: Lacrosse goal

source: mihšipakw-
en_us: Leaf

source: mihšipakwaapow-
en_us: Tea

source: mihšipakwahkihkw-
en_us: Tea kettle, teapot

source: mihšitamiš-
en_us: Pin Oak (Quercus palustris)

source: miicaahkoons-
en_us: Lunch box

source: miici-
en_us: Eat it

source: miicion-
en_us: Food

source: miihkim-
en_us: Harvest him, pick him, gamble with him

source: miihkimwi-
en_us: Work

source: miihkimwikaan-
en_us: Office

source: miihkinkii-
en_us: Gamble

source: miihkintam-
en_us: Earn it, work for it, harvest it

source: miihkintamaw-
en_us: Work for him

source: miihkohkaw-
en_us: Encounter him, meet him unexpectedly

source: miihkoowee-
en_us: Guess

source: miihkweelim-
en_us: Remember him

source: miihkweelintaakan-
en_us: Memory

source: miihkweelintam-
en_us: Remember it

source: miihkwiteehee-
en_us: Remember

source: miihsaalakiinkwaakan-
en_us: Eyelash

source: miihsilookiaakan-
en_us: Body Hair

source: miihsitonaakan-
en_us: Moustache, beard

source: miihšiinkway-
en_us: Eyelid, eyelash

source: miikaahkii-
en_us: Fight

source: miikaal-
en_us: Fight him

source: miikaalition-
en_us: Battle

source: miil-
en_us: Give to him

source: miilosihkwaakan-
en_us: A joke

source: miimi-
en_us: Mourning dove (Zenaida marcroura)

source: miinawa
en_us: Either, or

source: miincip-
en_us: Corn, maize (Zea mays)

source: miincipaahkw-
en_us: Corn stalk

source: miincipahk-
en_us: Corn field

source: miincipehkii-
en_us: Pick corn, harvest corn

source: miincipikaan-
en_us: Corn Crib

source: miinoohsakay-
en_us: Morel Mushroom, Tripe (Morchella esculenta)

source: miintikw-
en_us: Screech Owl (Otis asio)

source: miisaakan-
en_us: Toilet, commode

source: miisii-
en_us: Defecate, poop

source: miisiikaan-
en_us: Outhouse

source: miiw-
en_us: Trail, road

source: miišaakan-
en_us: leather

source: miišimaah-
en_us: Long ago, a long time ago

source: miišiminaakosi-
en_us: be accustomed to

source: miišimitaakan-
en_us: Stocking, sock

source: mikici-
en_us: Bald Eagle (Haliaeetus leucocephalus)

source: mikiciaankan-
en_us: Eagle feather

source: mikihkw-
en_us: Elder woman, old woman

source: milantaakan-
en_us: Vomit

source: milatee-
en_us: be burnt or stuck to the pot, as soup etc.

source: milemaawi-
en_us: It is dewy

source: miloht-
en_us: Before, in front (of)

source: miloniteeheekaan-
en_us: Classroom

source: miloohkami-
en_us: It is spring

source: minahanw-
en_us: Island, continent

source: minayon-
en_us: Beverage, drink

source: minohsay-
en_us: Painted hide

source: minooteen-
en_us: Town, village

source: minooteenhs-
en_us: Small town

source: mintaakan-
en_us: Disease

source: misaahak-
en_us: Everywhere, all over, all around

source: misecikaahkwikaan-
en_us: Log cabin

source: misesaahkw-
en_us: Horsefly (Diptera spp.)

source: misi
en_us: Everywhere, whole, entire

source: misihkw-
en_us: Hail

source: miteehkw-
en_us: Medicine Woman

source: miteew-
en_us: Medicine Person

source: mišwaakan-
en_us: Wound, scar

source: moohci
en_us: No, not

source: moohkihsee-
en_us: It comes to the surface quickly

source: moohkihsen-
en_us: It is flooded

source: moohkii-
en_us: Surface, emerge (from water)

source: moohkinatoo-
en_us: Fill it

source: moohsi-
en_us: Bug, Worm

source: moohsohkiišikomin-
en_us: buckeye nut

source: moohsohkiišikomiš-
en_us: Ohio Buckeye tree (Aesculus glabra), Yellow Buckeye tree (Aesculus flava)

source: moohsw-
en_us: White-tail deer (Odocoileus virginianus)

source: moohswalw-
en_us: Buckshot

source: moohsway-
en_us: Deer skin

source: moohšihtoo-
en_us: Sense it, feel apprehensive about it, suspicious of it

source: mooleelim-
en_us: Hope, wish for him

source: mooleelintam-
en_us: Hope, wish for it

source: mooleeliteeheeyaankwee-
en_us: Have a hopeful face, looks confident

source: moonaapitee-
en_us: Be toothless

source: moonahaakan-
en_us: Plow (tool)

source: moonaham-
en_us: Farm it, plow it

source: moonahiko-
en_us: Farming, plowing

source: moonawahki-
en_us: It is denuded land, land stripped bare

source: mootaakan-
en_us: Merchandise

source: mootay-
en_us: holder, pouch, pocket

source: mooy-
en_us: Dung, fecal matter, shit

source: mooyaakan-
en_us: Manure

source: mooyiinkweena siipiiw-
en_us: Des Moines River (Iowa), La Moine River (Illinois)

source: moošakan-
en_us: Be good, beautiful weather

source: moošaki
en_us: always

source: moošam-
en_us: To cut it (hair)

source: moošihtoo-
en_us: Sense it, suspect it, feel apprehensive about it

source: moošiko-
en_us: To mow

source: moošinam-
en_us: Sense it, perceive it

source: moošoon-
en_us: topknot, hair roach

source: moošw-
en_us: Cut his hair

source: moošwaakan-
en_us: Lawn mower, scythe, sickle

source: moošwaakant-
en_us: Scissors

source: myaalaahkwiihsini-
en_us: To diet

source: myaalahkihki-
en_us: Be thick, dense forest

source: myaalameekw-
en_us: Catfish (Ictalurus punctatus)

source: myaalameekwa siipiiw-
en_us: Rock River ( Wisconsin, Illinois)

source: myaalameekwi-siipiiw-
en_us: Meramec River (Missouri)

source: myaaleelimwi-
en_us: Sad, distressed

source: myaalisi-
en_us: Be dangerously ill

source: myaalwamiš-
en_us: Ironwood/American Hophornbeam (Ostrya virginiana), American Hornbeam (Carpinus caroliniana), Musclewood

source: myaalweehk-
en_us: Walnut tree (Generic)

source: myaami-
en_us: Miami person

source: myaamia atahsapimawaal-
en_us: Myaamia community web

source: myaamia nipwaayonikaan-
en_us: Myaamia Center

source: myaamiaatawee-
en_us: Speak miami

source: myaamiihkwi-
en_us: Miami woman

source: myaamiinaakosi-
en_us: Appear myaamia

source: myaamiiwi-
en_us: Be miami

source: myaašikinoonši-
en_us: Muskellunge (Esox masquinongy)

source: -naapeem-
en_us: Husband

source: -napaakay-
en_us: forearm

source: -nehk-
en_us: Hand, forearm

source: -nehkiaakan-
en_us: Finger

source: -niicaanihs-
en_us: one's child

source: -niipataakan-
en_us: collarbone

source: -nkwan-
en_us: Ankle

source: -noway-
en_us: cheek

source: -nsooy-
en_us: Tail

source: -ntep-
en_us: Brain

source: -ntepikan-
en_us: Head

source: naahkiipion-
en_us: Chair

source: naahsaloonam-
en_us: Open it, unfold it

source: naaka
en_us: affirmation (women only), yes, ok, sure

source: naal-
en_us: Fetch him, get him

source: naalimpi-
en_us: Cottonmouth, water moccasin snake (Agkistrodon piscivorus)

source: naaminohtan-
en_us: Flow downward

source: naanaamaahsin-
en_us: It is shaken by the wind

source: naanaamaamihki-
en_us: the ground shakes, there is an earthquake

source: naanaamikaapaawi-
en_us: It stands shaking

source: naanahaantawi-
en_us: Black rat snake (Elaphe obsoleta obsoleta)

source: naanahamišaahkw-
en_us: Eastern White Pine, Weeping White Pine (Pinus strobus)

source: naanipi-
en_us: Water snake

source: naankicii-
en_us: To be light weight

source: naanoohkakooti-
en_us: Soft-shell turtle

source: naanoohkilaakiimiš-
en_us: Chinkapin Oak (Quercus muehlenbergii)

source: naanoohkite
en_us: More and more

source: naante
en_us: Until, at last

source: naapihkaakan-
en_us: Necklace

source: naapihsetoo-
en_us: replace it, take it in place of something else

source: naapiinkweehw-
en_us: Bridle him

source: naapiinkwi-
en_us: False-face healer

source: naapiinkwiaakan-
en_us: Bridle

source: naapinaakan-
en_us: Shirt

source: naapinam-
en_us: Wear it, put it on, get dressed

source: naapinamoh-
en_us: Dress him

source: naapiwiinswi-
en_us: Take a replacement name

source: naapiši
en_us: Likewise, also, too

source: naataw-
en_us: Fetch it for him, get it for him

source: naate-
en_us: Fetch it, go get it

source: naatoowia siipiiw-
en_us: East River (West Virginia)

source: naatowi-
en_us: Iroquois person, Seneca-Cayuga

source: naaw-
en_us: Almost, nearly

source: naayohkaa-
en_us: It is broken, cracked

source: naayohšim-
en_us: Break him, crush him

source: naayonam-
en_us: Break it, crush it by hand
